Curso_CFD_OS_2025/cilindro_snappy/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-2 -2 0)
    ( 8 -2 0)
    ( 8  2 0)
    (-2  2 0)
    (-2 -2 0.1)
    ( 8 -2 0.1)
    ( 8  2 0.1)
    (-2  2 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
 inlet
 {
   type wall;
   faces
     (
      (0 4 7 3)
      );
 }
 outlet
 {
   type wall;
   faces
     (
      (2 6 5 1)
      );
 }
 top
 {
   type wall;
   faces
     (
      (3 7 6 2)
      );
 }
 bottom
 {
   type wall;
   faces
     (
      (1 5 4 0)
      );
 }
 front
 {
   type empty;
   faces
     (
      (4 5 6 7)
      );
 }
 back
 {
   type empty;
   faces
     (
      (0 3 2 1)
      );
 }

 );

mergePatchPairs
(
);

// ************************************************************************* //
